/////  ЗАДАЧА № 1 Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// Random rand = new Random();
// int num = rand.Next(100, 1000);
// System.Console.WriteLine($"Случайное число: {num}");

// int num1 = num / 10;  
// int res = num1 % 10;

// System.Console.WriteLine($"Вторая цифра {res}");


/////  ЗАДАЧА № 2 Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. 
                                                                                             